nc: 10  # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
fusion_mode: bifpn
node_mode: C2f
head_channel: 256


backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, MFA, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, C2f, [1024, True]]
head:
  - [ 4, 1, MDSCA, [ head_channel ] ]
  - [ 6, 1, MDSCA, [ head_channel ] ]
  - [ 10, 1, MDSCA, [ head_channel ] ]

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]
  - [ [ -1, 12 ], 1, Fusion, [ fusion_mode ] ]
  - [ -1, 3, TMFA, [ head_channel ] ]

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]
  - [ [ -1, 11 ], 1, Fusion, [ fusion_mode ] ]
  - [ -1, 3, TMFA, [ head_channel ] ]

  - [ 2, 1, Conv, [ head_channel, 3, 2 ] ]
  - [ -1, 1, TMFA, [256] ]

  - [ [ -1, 11, 19], 1, Fusion, [ fusion_mode ] ]
  - [ -1, 3, TMFA, [ head_channel ] ]

  - [ -1, 1, Conv, [ head_channel, 3, 2 ] ]
  - [ [ -1, 12, 16 ], 1, Fusion, [ fusion_mode ] ]
  - [ -1, 3, TMFA, [ head_channel ] ]

  - [ -1, 1, Conv, [ head_channel, 3, 2 ] ]
  - [ [ -1, 13 ], 1, Fusion, [ fusion_mode ] ]
  - [ -1, 3, TMFA, [ head_channel ] ]

  - [ [ 21, 23, 26, 29], 1, Detect, [ nc ] ]  # Detect
